_org/_posts/2014-11-11-emacs-and-latex.org
#+OPTIONS: toc:nil
#+OPTIONS: num:0
#+BEGIN_EXPORT html
---
layout: post
title:  "Emacs and Latex"
date:   2014-11-11
categories:
---
#+END_EXPORT

Recently, I've had to use Latex for the first time in a while (other than very minor things). Notably, I'm using Emacs, as opposed to some of the other editors I've used in the past, from the simple (Sublime Text), to full-on IDEs, to a Frankenstein most of the two (LyX), and Emacs definitely has the best of both worlds. While I'm sure there is much more to learn, the maximum bang-for-the-buck that I've gotten is from ~latex-preview-pane~:

#+BEGIN_SRC emacs-lisp
  (use-package latex-preview-pane
    :commands latex-preview-pane-mode
    :diminish latex-preview-pane-mode
    :init (add-hook 'LaTeX-mode-hook
                    '(lambda ()
                       (delete-other-windows)
                       (latex-preview-pane-mode))))
#+END_SRC

When you open a ~.tex~ file, another window is opened with the preview (in ~doc-view-mode~) and the preview is refreshed every time the file is saved.
